/*
 *    osi七层模型：应用层             TCP/IP 4 层模型： 应用层               TCP/IP 5 层模型：应用层   
                表示层                               传输层                              传输层
                会话层                                网络层                             网络层
                传输层                                网络接口层                          数据链路层
                网络层                                                                  物理层
                数据链路层
                物理层

      tcp属于传输层
 * 
 * 
 */